app/views/musicians/_form.html.erb

		<%= instrument_fields.label :instrument_category %>
		<%= instrument_fields.select :instrument_category, Instrument.all_families%>
---
SELECT "instruments".* FROM "instruments" WHERE "instruments"."musician_id" = $1  [["musician_id", 6]]