app/views/musicians/new.html.erb

		<%= instrument_fields.label :instrument_category %>
		<%= instrument_fields.select :instrument_category, Instrument.all_families%>
---
SELECT "instruments".* FROM "instruments"