app/views/musicians/show.html.erb

SELECT "instruments".* FROM "instruments" WHERE "instruments"."musician_id" = $1  [["musician_id", 2]]
---
<h2>Your instruments</h2>
<% if @musician.instruments.present? %>