app/controllers/application_controller.rb

DELETE FROM "musicians" WHERE "musicians"."id" = $1  [["id", 6]]
DELETE FROM "instruments" WHERE "instruments"."id" = $1  [["id", 7]]
DELETE FROM "pieces" WHERE "pieces"."id" = $1  [["id", 2]]
DELETE FROM "mastery_tracks" WHERE "mastery_tracks"."id" = $1  [["id", 1]]
DELETE FROM "transpositions" WHERE "transpositions"."id" = $1  [["id", 1]]
DELETE FROM "piece_transpositions" WHERE "piece_transpositions"."id" = $1  [["id", 1]]
---
	def scorched_earth
		session.clear
		Musician.destroy_all
		Instrument.destroy_all
		Piece.destroy_all
		MasteryTrack.destroy_all
		Transposition.destroy_all
		PieceTransposition.destroy_all

SELECT "musicians".* FROM "musicians" WHERE "musicians"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
	def current_musician
		logged_in? && (@current_musician ||= Musician.find_by(id: session[:musician_id]))