app/controllers/instruments_controller.rb

SELECT "musicians".* FROM "musicians" WHERE "musicians"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def new
		authorized?(params[:musician_id])
		@instrument = Instrument.new
		@musician = Musician.find_by(id: params[:musician_id])

INSERT INTO "instruments" ("instrument_type", "instrument_category", "tuning", "musician_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "musicians".* FROM "musicians" ORDER BY "musicians"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE "instruments"."musician_id" = $1  [["musician_id", 5]]
---
	def create
		if authorized?(instrument_params[:musician_id])
			@instrument = Instrument.new(instrument_params)
			@musician = @instrument.musician
			@instrument.save && (redirect_to(musician_path(@musician)) and return)
			flash[:alert] = @instrument.errors.full_messages.first

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def show
		@instrument = Instrument.find_by(id: params[:id])

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
	def edit
		@instrument = Instrument.find_by(id: params[:id])

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "instruments" SET "instrument_type" = $1, "instrument_category" = $2, "tuning" = $3, "updated_at" = $4 WHERE "instruments"."id" = $5  [["instrument_type", "Voice"], ["instrument_category", "Voice"], ["tuning", "None"], ["updated_at", "2019-11-06 18:42:26.768877"], ["id", 26]]
---
	def update
		@instrument = Instrument.find_by(id: params[:id])
		@instrument.update(instrument_params)

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "instruments" WHERE "instruments"."id" = $1  [["id", 16]]
---
	def destroy
		@instrument = Instrument.find_by(id: params[:id])
		@musician = @instrument.musician
		authorized?(@musician.id) && @instrument.destroy