app/controllers/mastery_tracks_controller.rb

	def create
		@mastery_track = MasteryTrack.find_by(piece_id: mastery_params[:piece_id], instrument_id: mastery_params[:instrument_id])
		@mastery_track ||= MasteryTrack.new(mastery_params)
		@instrument.mastery_tracks.include?(@mastery_track) && (redirect_to instrument_path(@instrument) and return)
---
SELECT "mastery_tracks".* FROM "mastery_tracks" WHERE "mastery_tracks"."piece_id" = $1 AND "mastery_tracks"."instrument_id" = $2 LIMIT $3  [["piece_id", 134], ["instrument_id", 38], ["LIMIT", 1]]
SELECT 1 AS one FROM "mastery_tracks" WHERE "mastery_tracks"."instrument_id" = $1 AND "mastery_tracks"."id" = $2 LIMIT $3  [["instrument_id", 38], ["id", 31], ["LIMIT", 1]]