app/controllers/mastery_tracks_controller.rb

	def new
		# binding.pry
		@musician = current_musician
		@piece = Piece.find_by(id: params[:piece_id])
		@instrument = Instrument.find_by(id: params[:instrument_id])
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

	def create
		@instrument = Instrument.find_by(id: params[:mastery_track][:instrument_id])
		@musician = Musician.find_by(id: @instrument.musician_id)
		@piece = Piece.find_by(id: params[:mastery_track][:piece_id])
		authorized?(@musician.id)
		@mastery_track = MasteryTrack.new(mastery_params)
		if @mastery_track.save
---
SELECT "mastery_tracks".* FROM "mastery_tracks" WHERE "mastery_tracks"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "musicians".* FROM "musicians" WHERE "musicians"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "mastery_tracks" ("tempo_level", "tempo_goal", "instrument_id", "piece_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["tempo_level", 50], ["tempo_goal", 128], ["instrument_id", 16], ["piece_id", 18], ["created_at", "2019-11-05 04:01:55.274832"], ["updated_at", "2019-11-05 04:01:55.274832"]]

	def edit
		@mastery_track = MasteryTrack.find_by(id: params[:id])
---
SELECT "mastery_tracks".* FROM "mastery_tracks" WHERE "mastery_tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def update
		@mastery_track = MasteryTrack.find_by(id: params[:id])
		@mastery_track.update(tempo_level: params[:mastery_track][:tempo_level], tempo_goal: params[:mastery_track][:tempo_goal])
---
SELECT "mastery_tracks".* FROM "mastery_tracks" WHERE "mastery_tracks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "mastery_tracks" SET "tempo_level" = $1, "updated_at" = $2 WHERE "mastery_tracks"."id" = $3  [["tempo_level", 50], ["updated_at", "2019-11-05 05:53:47.560263"], ["id", 13]]

	def destroy
		@mastery_track = MasteryTrack.find_by(id: params[:id])
		@instrument = @mastery_track.instrument
		@piece = @mastery_track.piece
		@mastery_track.destroy
---
SELECT "mastery_tracks".* FROM "mastery_tracks" WHERE "mastery_tracks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "mastery_tracks" WHERE "mastery_tracks"."id" = $1  [["id", 10]]