app/controllers/musicians_controller.rb

INSERT INTO "musicians" ("user_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		@musician = Musician.new(musician_params)
		if @musician.save