app/controllers/pieces_controller.rb

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
	def new
		@piece = Piece.new
		@piece.transpositions.build()
		@instrument = Instrument.find_by(id: params[:instrument_id])

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "pieces" ("title", "created_at", "updated_at", "composer") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Bolero"], ["created_at", "2019-11-07 03:12:26.163747"], ["updated_at", "2019-11-07 03:12:26.163747"], ["composer", "Ravel"]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."title" = $1 AND "pieces"."composer" = $2 LIMIT $3  [["title", "The Throne Room - Star Wars"], ["composer", "John Williams"], ["LIMIT", 1]]
INSERT INTO "transpositions" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-03 23:22:04.128764"], ["updated_at", "2019-11-03 23:22:04.128764"]]
INSERT INTO "pieces" ("title", "key_signature", "time_signature", "difficulty", "tempo", "created_at", "updated_at", "composer", "added_by") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT 1 AS one FROM "pieces" WHERE "pieces"."title" = $1 AND "pieces"."composer" = $2 LIMIT $3  [["title", "The Throne Room - Star Wars"], ["composer", "John Williams"], ["LIMIT", 1]]
INSERT INTO "piece_transpositions" ("piece_id", "transposition_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["piece_id", 4], ["transposition_id", 2], ["created_at", "2019-11-04 06:46:18.084339"], ["updated_at", "2019-11-04 06:46:18.084339"]]
INSERT INTO "transpositions" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-04 07:37:22.308808"], ["updated_at", "2019-11-04 07:37:22.308808"]]
---
	def create
		@instrument = Instrument.find_by(id: (params[:instrument_id] || params[:piece][:instrument_id]))
		!logged_in && (redirect_to welcome_path and return)
		@piece = Piece.new(piece_params.merge({added_by: @instrument.musician_id}))
		if @piece.save
			redirect_to instrument_pieces_path(@instrument) and return # maybe set something up where it will return you to where you came from
		elsif  @piece.errors[:title]&.include?("has already been taken")
			@piece = Piece.find_by(title: @piece.title, composer: @piece.composer)
			@transposition = Transposition.find_or_create_by(piece_params[:transposition_attributes])
			!@piece.transpositions&.include?(@transposition) && (@piece.transpositions << @transposition)

SELECT "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
	def show
		@piece = Piece.find_by(id: params[:id])
		@instrument = Instrument.find_by(id: params[:instrument_id])

SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "pieces".* FROM "pieces"
SELECT 1 AS one FROM "pieces" LIMIT $1  [["LIMIT", 1]]
SELECT "instruments".* FROM "instruments" WHERE "instruments"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT "pieces".* FROM "pieces" INNER JOIN "piece_transpositions" ON "piece_transpositions"."piece_id" = "pieces"."id" INNER JOIN "transpositions" ON "transpositions"."id" = "piece_transpositions"."transposition_id" WHERE (transpositions.instrument = 'Trumpet')
SELECT 1 AS one FROM "instruments" INNER JOIN "mastery_tracks" ON "instruments"."id" = "mastery_tracks"."instrument_id" WHERE "mastery_tracks"."piece_id" = $1 AND "instruments"."id" = $2 LIMIT $3  [["piece_id", 18], ["id", 16], ["LIMIT", 1]]
---
	def index
		@instrument = Instrument.find_by(id: params[:instrument_id])
		if @instrument&.tuning != 'None'
			@pieces = Piece.select_key(@instrument.tuning) + Piece.select_instrument(@instrument.instrument_type)
			@pieces = @pieces.uniq.reject{ |piece| piece.instruments.include?(@instrument) }
		else
			@pieces = Piece.all