app/controllers/pieces_controller.rb

	def show
		@piece = Piece.find_by(id: params[:id])
		@instrument = Instrument.find_by(id: params[:instrument_id])
		@mastery_track = MasteryTrack.find_by(instrument_id: @instrument.id, piece_id: @piece.id)
---
SELECT "mastery_tracks".* FROM "mastery_tracks" WHERE "mastery_tracks"."instrument_id" = $1 AND "mastery_tracks"."piece_id" = $2 LIMIT $3  [["instrument_id", 38], ["piece_id", 134], ["LIMIT", 1]]