app/controllers/sessions_controller.rb

SELECT "musicians".* FROM "musicians" WHERE "musicians"."user_name" = $1 LIMIT $2  [["user_name", "trumpetj"], ["LIMIT", 1]]
---
  def create
  	@musician = Musician.find_by(user_name: session_params[:user_name])