app/controllers/sessions_controller.rb

SELECT "musicians".* FROM "musicians" WHERE "musicians"."github_uid" = $1 LIMIT $2  [["github_uid", 7810020], ["LIMIT", 1]]
SELECT "musicians".* FROM "musicians" WHERE "musicians"."user_name" = $1 LIMIT $2  [["user_name", "jmcgloin"], ["LIMIT", 1]]
INSERT INTO "musicians" ("user_name", "created_at", "updated_at", "github_uid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "jmcgloin-7810020"], ["created_at", "2019-11-07 04:16:51.276563"], ["updated_at", "2019-11-07 04:16:51.276563"], ["github_uid", 7810020]]
---
  def create

    # if auth_hash&.[]("uid")
    #   @musician = Musician.find_by(github_uid: auth_hash["uid"])
    #   if !@musician
    #     user_name = auth_hash["info"]["nickname"]
    #     Musician.find_by(user_name: user_name) && (user_name += "-#{auth_hash["uid"]}")
    #     @musician = Musician.create(
    #       user_name: user_name,
    #       email: auth_hash["info"]["email"],
    #       github_uid: auth_hash["uid"]
    #     )
    #   end
    # else
    #   @musician = Musician.find_by(user_name: session_params[:user_name])
    # end

    auth_hash&.[]("uid") && (@musician = Musician.find_by(github_uid: auth_hash["uid"]))
    if auth_hash&.[]("uid") && !@musician
      user_name = auth_hash["info"]["nickname"]
      Musician.find_by(user_name: user_name) && (user_name += "-#{auth_hash["uid"]}")
      @musician = Musician.create(
        user_name: user_name,
        email: auth_hash["info"]["email"],
        github_uid: auth_hash["uid"]
      )
    end

    @musician ||= Musician.find_by(user_name: session_params[:user_name])